import os
from langchain_community.llms import VLLM

llm = VLLM(
    model='Qwen/Qwen2.5-14B-Instruct',
    trust_remote_code=True,
    max_new_tokens=128,
    top_k=10,
    top_p=0.95,
    temperature=0.8,
)

category_id_to_name = {
    "CAT_001": "Как начать работу",
    "CAT_002": "Заправка",
    "CAT_003": "Ремонт и обслуживание",
    "CAT_004": "Дорожные платежи",
    "CAT_005": "Страхование",
    "CAT_006": "Маркетплейс",
    "CAT_007": "Управление автопарком",
    "CAT_008": "Сервисы для бизнеса",
    "CAT_009": "Финансовые сервисы",
    "CAT_010": "Цифровые сервисы",
    "CAT_011": "Интерфейсы",
    "CAT_012": "Инструкции",
    "CAT_013": "Реферальная программа Рекомендация",
    "CAT_014": "UNKNOWN - неопределенный класс"
}

subcategory_id_to_name = {
    "CAT_001": {
        "SUB_001_01": "Виртуальные карты",
        "SUB_001_02": "Добавление сотрудников и авто в Личный Кабинет",
        "SUB_001_03": "Инструкции по работе с Личным Кабинетом",
        "SUB_001_04": "Начало работы в мобильном приложении ППР",
    },
    "CAT_002": {
        "SUB_002_01": "Топливо",
        "SUB_002_02": "Электрозарядки",
        "SUB_002_03": "Товары на АЗС",
        "SUB_002_04": "Доставка топлива",
    },
    "CAT_003": {
        "SUB_003_01": "Мойки",
        "SUB_003_02": "Шиномонтаж",
        "SUB_003_03": "Ремонт и ТО",
        "SUB_003_04": "Хранение шин и дисков",
        "SUB_003_05": "Выездной шиномонтаж",
        "SUB_003_06": "Заправка автомобильных кондиционеров",
    },
    "CAT_004": {
        "SUB_004_01": "Штрафы",
        "SUB_004_02": "Парковки",
        "SUB_004_03": "Платные дороги",
        "SUB_004_04": "Поиощь на дорогах",
        "SUB_004_05": "Эвакуаторы",
    },
    "CAT_005": {
        "SUB_005_01": "Страхование авто",
        "SUB_005_02": "КАСКО с топливом",
        "SUB_005_03": "Страхование грузов",
        "SUB_005_04": "Страхование ответственности",
    },
    "CAT_006": {
        "SUB_006_01": "Покупка шин и дисков",
        "SUB_006_02": "Запчасти",
    },
    "CAT_007": {
        "SUB_007_01": "Модуль управление автопарком",
        "SUB_007_02": "Электронные путевые листы",
    },
    "CAT_008": {
        "SUB_008_01": "Такси, доставка, еда и товары",
        "SUB_008_02": "Каршеринг",
        "SUB_008_03": "Командировки",
        "SUB_008_04": "Трансферы",
    },
    "CAT_009": {
        "SUB_009_01": "Лизинг",
        "SUB_009_02": "Отсрочка платежа",
    },
    "CAT_010": {
        "SUB_010_01": "API",
    },
    "CAT_011": {
        "SUB_011_01": "Личный кабинет",
        "SUB_011_02": "Мобильное приложение",
        "SUB_011_03": "Чат-бот",
        "SUB_011_04": "Гараж",
    },
    "CAT_012": {
        "SUB_012_01": "Правила оплаты",
    },
    "CAT_013": {
        "SUB_013_01": "О программе Рекомендация",
        "SUB_013_02": "Как принять участие",
        "SUB_013_03": "Как воспользоваться бонусами Benzuber",
    },
}

third_level_category_id_to_name = {
    "SUB_002_01": {
        "SUB_002_01_01": "Что такое топливная карта",
        "SUB_001_01_02": "Как топливная карта упрощает бизнес",
        "SUB_001_01_03": "Выбор топливной карты",
        "SUB_001_01_04": "Управление топливной картой",
        "SUB_001_01_05": "Сеть приема топливных карт",
    },
    "SUB_002_02": {
        "SUB_002_02_01": "О сервисе Электрозарядки",
        "SUB_002_02_02": "Как подключить Электрозарядки",
        "SUB_002_02_03": "Сеть приема Электрозарядок",
    },
    "SUB_002_03": {
        "SUB_002_03_01": "О сервисе Товары на АЗС",
        "SUB_002_03_02": "Как подключить Товары на АЗС",
        "SUB_002_03_03": "Сеть приема Товаров на АЗС",
        "SUB_002_03_04": "Акции на товары на АЗС",
    },
    "SUB_002_04": {
        "SUB_002_04_01": "О сервисе Доставка топлива",
        "SUB_002_04_02": "Как подключить Доставку топлива",
        "SUB_002_04_03": "Управление заказом доставки топлива",
        "SUB_002_04_04": "Доставка топлива: большой объем",
    },
    "SUB_003_01": {
        "SUB_003_01_01": "О сервисе Мойка",
        "SUB_003_01_02": "Как подключить Мойки",
        "SUB_003_01_03": "Сеть приема Моек",
        "SUB_003_01_04": "Оплата мойки через PPR Pay",
    },
    "SUB_003_02": {
        "SUB_003_02_01": "О сервисе Шиномонтаж",
        "SUB_003_02_02": "Как подключить Шиномонтаж",
        "SUB_003_02_03": "Сеть приема Шиномонтажа",
    },
    "SUB_003_03": {
        "SUB_003_03_01": "О сервисе Ремонт и ТО",
        "SUB_003_03_02": "Как подключить Ремонт и ТО",
    },
    "SUB_003_04": {
        "SUB_003_04_01": "О сервисе Хранение шин и дисков",
        "SUB_003_04_02": "Как подключить Хранение шин и дисков",
        "SUB_003_04_03": "Адреса складов для хранения шин и дисков",
        "SUB_003_04_04": "Стоимость хранения шин и дисков",
    },
    "SUB_003_05": {
        "SUB_003_05_01": "О сервисе Выездной шиномонтаж",
        "SUB_003_05_02": "Как подключить Выездной шиномонтаж",
        "SUB_003_05_03": "Стоимость Выездного шиномонтажа",
    },
    "SUB_003_06": {
        "SUB_003_06_01": "О сервисе Заправка автомобильных кондиционеров",
        "SUB_003_06_02": "Как подключить Заправку автомобильных кондиционеров",
    },
    "SUB_004_01": {
        "SUB_004_01_01": "О сервисе Штрафы",
        "SUB_004_01_02": "Мониторинг штрафов",
        "SUB_004_01_03": "Оплата штрафов",
        "SUB_004_01_04": "Обжалование штрафов",
    },
    "SUB_004_02": {
        "SUB_004_02_01": "О сервисе Парковки",
        "SUB_004_02_02": "Как подключить Парковки",
        "SUB_004_02_03": "Парковочная сессия",
    },
    "SUB_004_03": {
        "SUB_004_03_01": "О сервисе Платные дороги",
        "SUB_004_03_02": "Транспондеры",
        "SUB_004_03_03": "Стоимость проезда",
    },
    "SUB_004_04": {
        "SUB_004_04_01": "О сервисе Помощь на дорогах",
        "SUB_004_04_02": "Как подключить Помощь на дорогах",
    },
    "SUB_004_05": {
        "SUB_004_04_01": "О сервисе Эвакуаторы",
        "SUB_004_04_02": "Как подключить Эвакуаторы",
        "SUB_004_04_03": "Как вызвать Эвакуатор в Мобильном приложении",
    },
    "SUB_005_01": {
        "SUB_005_01_01": "Страхование ОСАГО",
        "SUB_005_01_02": "Страхование КАСКО",
    },
    "SUB_005_02": {
        "SUB_005_02_01": "О сервисе Каско с топливом",
        "SUB_005_02_02": "Как подключить Каско с топливом",
    },
    "SUB_005_03": {
        "SUB_005_03_01": "О сервисе Страхование грузов",
        "SUB_005_03_02": "Как подключить Страхование грузов",
    },
    "SUB_005_04": {
        "SUB_005_04_01": "Отличие перевозчика от экспедитора",
        "SUB_005_04_02": "Что страхуем по услуге ответственность перевозчика и экспедитора",
        "SUB_005_04_03": "Страхование ответственности перевозчика",
        "SUB_005_04_04": "Страхование ответственности экспедитора",
    },
    "SUB_006_01": {
        "SUB_006_01_01": "О сервисе Шины и диски",
        "SUB_006_01_02": "Как подключить Шины и диски",
        "SUB_006_01_03": "Доставка шин и дисков",
    },
    "SUB_006_02": {
        "SUB_006_02_01": "О сервисе Запчасти",
        "SUB_006_02_02": "Как подключить Запчасти",
    },
    "SUB_007_01": {
        "SUB_007_01_01": "О сервисе Управление автопарком",
        "SUB_007_01_02": "Как подключить Управление автопарком",
    },
    "SUB_007_02": {
        "SUB_007_02_01": "О сервисе ЭПЛ",
        "SUB_007_02_02": "Как подключить ЭПЛ",
    },
    "SUB_008_01": {
        "SUB_008_01_01": "О сервисе Такси, доставка, еда и товары",
        "SUB_008_01_02": "Инструкции по подключению и использованию сервиса Такси, доставка, еда и товары",
        "SUB_008_01_03": "Инструкция по использованию мобильного приложения Яндекс Go",
        "SUB_008_01_04": "Инструкция по использованию мобильного приложения Bibi",
        "SUB_008_01_05": "Инструкция по использованию мобильного приложения SwiftDrive",
    },
    "SUB_008_02": {
        "SUB_008_02_01": "О сервисе Каршеринг",
        "SUB_008_02_02": "Как подключить Каршеринг",
        "SUB_008_02_03": "Инструкция по использованию BelkaCar",
        "SUB_008_02_04": "Инструкция по использованию Яндекс Драйв",
    },
    "SUB_008_03": {
        "SUB_008_03_01": "О сервисе Командировки",
        "SUB_008_03_02": "Как подключить Командировки",
        "SUB_008_03_03": "Управление Командировками",
    },
    "SUB_008_04": {
        "SUB_008_04_01": "О сервисе Трансферы",
        "SUB_008_04_02": "Как подключить Трансферы",
        "SUB_008_04_03": "Инструкция по работе в личном кабинете IWAY",
    },
    "SUB_009_01": {
        "SUB_009_01_01": "О сервисе Лизинг",
        "SUB_009_01_02": "Как подключить Лизинг",
        "SUB_009_01_03": "Партнеры по лизингу",
    },
    "SUB_009_02": {
        "SUB_009_02_01": "Недельное Кредитование",
        "SUB_009_02_02": "Двухнедельное кредитование",
    },
    "SUB_010_01": {
        "SUB_010_01_01": "О сервисе API на чтение",
        "SUB_010_01_02": "Как подключить и начать использовать API на чтение",
        "SUB_010_01_03": "Стоимость услуги API на чтение",
    },
    "SUB_011_01": {
        "SUB_011_01_01": "О Личном кабинете",
        "SUB_011_01_02": "Доступ в личный кабинет",
        "SUB_011_01_03": "Группа компаний",
        "SUB_011_01_04": "Настройки компании",
        "SUB_011_01_05": "Заказ и активация карт",
        "SUB_011_01_06": "Раздел Карты",
        "SUB_011_01_07": "Раздел Транзакции",
        "SUB_011_01_08": "Раздел Отчеты и графики",
        "SUB_011_01_09": "Раздел Документы",
        "SUB_011_01_10": "Раздел Услуги",
        "SUB_011_01_11": "Раздел Сеть приема",
        "SUB_011_01_12": "Раздел Заявки",
        "SUB_011_01_13": "Раздел Штрафы",
    },
    "SUB_011_02": {
        "SUB_011_02_01": "Начало работы в мобильном приложении",
        "SUB_011_02_02": "Доступ в мобильное приложение",
        "SUB_011_02_03": "PPR Pay",
        "SUB_011_02_04": "Система Быстрых Платежей",
        "SUB_011_02_05": "Оплата кофе на АЗС из приложения",
        "SUB_011_02_06": "Сбербизнес",
    },
    "SUB_011_03": {
        "SUB_011_03_01": "Доступ в чат-бот",
    },
    "SUB_011_04": {
        "SUB_011_04_01": "О сервисе Гараж",
        "SUB_011_04_02": "Как работать с разделом Гараж",
    },
    "SUB_012_01": {
        "SUB_012_01_01": "Счет-фактура",
        "SUB_012_01_02": "График зачисления платежей",
    },
}

def classify_text(text: str) -> tuple[str, str | None, str | None]:
    try:
        categories_list = "\n".join([f"{k}: {v}" for k, v in category_id_to_name.items()])
        level_1_prompt = f'''
        Ты — интеллектуальный классификатор пользовательских вопросов по работе с ППР.

        Вот список категорий первого уровня:
        {categories_list}

        Выбери ID наиболее подходящей категории из списка выше для следующего запроса:

        "{text}"

        Ответь **только** ID, например: CAT_003. Выбирай CAT_014 в том случае, если запрос не относится ни к одной из остальных категорий или если запрос непонятен.
        '''
        response_1 = llm.invoke(level_1_prompt)
        category_level_1 = response_1.strip()

        if category_level_1 == "CAT_014":
            return category_level_1, None, None

        subcategories_list = "\n".join([
            f"{k}: {v}" for k, v in subcategory_id_to_name[category_level_1].items()
        ])
        level_2_prompt = f'''
        Ты — интеллектуальный классификатор пользовательских запросов для ППР.

        На предыдущем этапе запрос был отнесён к категории первого уровня: **{category_level_1} ({category_id_to_name[category_level_1]})**

        Теперь выбери одну наиболее подходящую подкатегорию второго уровня из этого списка:
        {subcategories_list}

        Запрос:
        "{text}"

        Ответь **только** ID, например: SUB_003_02.
        '''
        response_2 = llm.invoke(level_2_prompt)
        category_level_2 = response_2.strip()

        if category_level_2 not in third_level_category_id_to_name:
            return category_level_1, category_level_2, None

        third_level_categories_list = "\n".join([
            f"{k}: {v}" for k, v in third_level_category_id_to_name[category_level_2].items()
        ])

        level_3_prompt = f'''
        Ты — интеллектуальный классификатор пользовательских запросов для ППР.

        На предыдущих этапах запрос был отнесён к категориям:
        - Уровень 1: **{category_level_1} ({category_id_to_name[category_level_1]})**
        - Уровень 2: **{category_level_2} ({subcategory_id_to_name[category_level_1][category_level_2]})**

        Теперь выбери одну наиболее подходящую подкатегорию третьего уровня из этого списка:
        {third_level_categories_list}

        Запрос:
        "{text}"

        Ответь **только** ID, например: SUB_002_01_01.
        '''
        response_3 = llm.invoke(level_3_prompt)
        category_level_3 = response_3.strip()

        return category_level_1, category_level_2, category_level_3

    except Exception as e:
        return "CAT_014", None, None